devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(SPI, void *device_handle)
{
        STOP_IF(!device_handle);

        struct spi_virtual *hdl = device_handle;

        stdret_t status = STD_RET_ERROR;

        critical_section_begin();
        if (device_is_unlocked(hdl->file_lock)) {

                spi_module->number_of_virtual_spi[hdl->major]--;

                /* deinitialize major device if all minor devices are deinitialized */
                if (spi_module->number_of_virtual_spi == 0) {
                        mutex_delete(spi_module->device_protect_mtx[hdl->major]);
                        spi_module->device_protect_mtx[hdl->major] = NULL;
                        semaphore_delete(spi_module->wait_irq_sem[hdl->major]);
                        spi_module->wait_irq_sem[hdl->major] = NULL;
                        spi_turn_off(spi[hdl->major]);
                }

                /* free module memory if all devices are deinitialized */
                bool free_module_mem = true;
                for (int i = 0; i < _SPI_NUMBER && free_module_mem; i++) {
                        free_module_mem = spi_module->device_protect_mtx[i] == NULL;
                }

                if (free_module_mem) {
                        free(spi_module);
                        spi_module = NULL;
                }

                /* free virtual spi memory */
                free(hdl);

                status = STD_RET_OK;
        } else {
                errno = EBUSY;
        }
        critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(SPI, void *device_handle, int flags)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(flags);

        struct spi_virtual *hdl = device_handle;

        return device_lock(&hdl->file_lock) ? STD_RET_OK : STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(SPI, void *device_handle, bool force, const task_t *opened_by_task)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(opened_by_task);

        struct spi_virtual *hdl = device_handle;

        if (device_is_access_granted(&hdl->file_lock) || force) {
                device_unlock(&hdl->file_lock, force);
                return STD_RET_OK;
        } else {
                errno = EBUSY;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(SPI, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);

        struct spi_virtual *hdl = device_handle;

        ssize_t n = -1;

        if (device_is_access_granted(&hdl->file_lock)) {
                if (mutex_lock(spi_module->device_protect_mtx[hdl->major], MUTEX_TIMOUT)) {
                        config_apply(hdl);
                        slave_deselect(hdl->major);
                        slave_select(hdl->major, hdl->minor);

                        spi_module->buffer[hdl->major] = (u8_t *)src;
                        spi_module->count[hdl->major]  = count;
                        spi_module->write[hdl->major]  = true;

                        SET_BIT(spi[hdl->major]->CR2, SPI_CR2_TXEIE);
                        semaphore_wait(spi_module->wait_irq_sem[hdl->major], SEMAPHORE_TIMEOUT);
                        while (spi[hdl->major]->SR & SPI_SR_BSY); /* flush buffer */

                        n = count - spi_module->count[hdl->major];

                        slave_deselect(hdl->major);
                        config_apply_safe(hdl->major);
                        mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                } else {
                        errno = ETIME;
                }
        } else {
                errno = EACCES;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(SPI, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);

        struct spi_virtual *hdl = device_handle;

        ssize_t n = -1;

        if (device_is_access_granted(&hdl->file_lock)) {
                if (mutex_lock(spi_module->device_protect_mtx[hdl->major], MUTEX_TIMOUT)) {
                        config_apply(hdl);
                        slave_deselect(hdl->major);
                        slave_select(hdl->major, hdl->minor);

                        spi_module->buffer[hdl->major] = dst;
                        spi_module->count[hdl->major]  = count;
                        spi_module->write[hdl->major]  = false;

                        u8_t tmp;
                        while (spi[hdl->major]->SR & SPI_SR_RXNE) {
                                tmp = spi[hdl->major]->DR;
                        }

                        SET_BIT(spi[hdl->major]->CR2, SPI_CR2_RXNEIE);
                        tmp = hdl->config.dummy_byte;
                        spi_module->dummy_byte[hdl->major]= tmp;
                        spi[hdl->major]->DR = tmp;
                        semaphore_wait(spi_module->wait_irq_sem[hdl->major], SEMAPHORE_TIMEOUT);
                        while (spi[hdl->major]->SR & SPI_SR_BSY); /* flush buffer */

                        n = count - spi_module->count[hdl->major];

                        slave_deselect(hdl->major);
                        config_apply_safe(hdl->major);
                        mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                } else {
                        errno = ETIME;
                }
        } else {
                errno = EACCES;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(SPI, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

