devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        struct spi_virtual *hdl    = device_handle;
        stdret_t            status = STD_RET_ERROR;

        if (device_is_access_granted(&hdl->file_lock)) {
                switch (request) {
                case SPI_IORQ_SET_CONFIGURATION:
                        if (arg) {
                                hdl->config = *(struct SPI_config *)arg;
                                status      = STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case SPI_IORQ_GET_CONFIGURATION:
                        if (arg) {
                                *(struct SPI_config *)arg = hdl->config;
                                status                    = STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                        break;

                case SPI_IORQ_LOCK:
                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case SPI_IORQ_UNLOCK:
                        if (mutex_unlock(spi_module->device_protect_mtx[hdl->major])) {
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case SPI_IORQ_SELECT:
                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                slave_select(hdl->major, hdl->minor);
                                mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case SPI_IORQ_DESELECT:
                        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                slave_deselect(hdl->major);
                                mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                                status = STD_RET_OK;
                        } else {
                                errno = EBUSY;
                        }
                        break;

                case SPI_IORQ_TRANSMIT:
                        if (arg) {
                                if (mutex_lock(spi_module->device_protect_mtx[hdl->major], 0)) {
                                        SPI_t *SPI = spi[hdl->major];

                                        while (SPI->SR & SPI_SR_RXNE) {
                                                u16_t tmp = SPI->DR;
                                                (void)tmp;
                                        }

                                        while (!(SPI->SR & SPI_SR_TXE));
                                        SPI->DR = *(u8_t *)arg;

                                        while (!(SPI->SR & SPI_SR_RXNE));
                                        *(u8_t *)arg = SPI->DR;

                                        mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
                                        status = STD_RET_OK;
                                }
                        } else {
                                errno = EINVAL;
                        }
                        break;

                default:
                        errno = EBADRQC;
                        break;
                }
        } else {
                errno = EACCES;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(SPI, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(SPI, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        struct spi_virtual *hdl = device_handle;

        device_stat->st_major = hdl->major;
        device_stat->st_minor = hdl->minor;
        device_stat->st_size  = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function enable SPI interface
 *
 * @param[in] *spi      spi peripheral
 */
//==============================================================================
static void spi_turn_on(SPI_t *spi)
{
        switch ((uint32_t)spi) {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  |=  RCC_APB2ENR_SPI1EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  |=  RCC_APB1ENR_SPI2EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  |=  RCC_APB1ENR_SPI3EN;
                break;
        #endif
        }
}

//==============================================================================
/**
 * @brief Function disable SPI interface
 *
 * @param[in] *spi      spi peripheral
 */
//==============================================================================
static void spi_turn_off(SPI_t *spi)
{
        switch ((uint32_t)spi) {
        #if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                break;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                break;
        #endif
        }
}

//==============================================================================
/**
 * @brief Function apply new configuration for selected SPI
 *
 * @param vspi          virtual spi handler
 */
//==============================================================================
static void config_apply(struct spi_virtual *vspi)
{
        const u16_t divider_mask[SPI_CLK_DIV_256 + 1] = {
                [SPI_CLK_DIV_2  ] 0x00,
                [SPI_CLK_DIV_4  ] SPI_CR1_BR_0,
                [SPI_CLK_DIV_8  ] SPI_CR1_BR_1,
                [SPI_CLK_DIV_16 ] SPI_CR1_BR_1 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_32 ] SPI_CR1_BR_2,
                [SPI_CLK_DIV_64 ] SPI_CR1_BR_2 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_128] SPI_CR1_BR_2 | SPI_CR1_BR_1,
                [SPI_CLK_DIV_256] SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
        };

        const u16_t spi_mode_mask[SPI_MODE_3 + 1] = {
                [SPI_MODE_0] 0x00,
                [SPI_MODE_1] SPI_CR1_CPHA,
                [SPI_MODE_2] SPI_CR1_CPOL,
                [SPI_MODE_3] SPI_CR1_CPOL | SPI_CR1_CPHA
        };

        SPI_t *SPI = spi[vspi->major];

        /* configure SPI divider */
        CLEAR_BIT(SPI->CR1, SPI_CR1_BR);
        SET_BIT(SPI->CR1, divider_mask[vspi->config.clk_divider]);

        /* configure SPI mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_CPOL | SPI_CR1_CPHA);
        SET_BIT(SPI->CR1, spi_mode_mask[vspi->config.mode]);

        /* 8-bit mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_DFF);

        /* set MSB/LSB */
        if (vspi->config.msb_first)
                CLEAR_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        else
                SET_BIT(SPI->CR1, SPI_CR1_LSBFIRST);

        /* NSS software mode */
        SET_BIT(SPI->CR1, SPI_CR1_SSM | SPI_CR1_SSI);

        /* set SPI as master */
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);

